# INTRODUCTION TO EDA

In [1]:
import pandas as pd
import numpy as np
from pandas import Series , DataFrame

In [ ]:
series1 = pd.Series(['Bangalore','Chennai','Hyderabad','Mumbai']) #we have used a list to create a series.
series1

In [ ]:
series1[0]

In [ ]:
ser1 = Series([5,10,15],index=['a','b','c'])
ser1

In [ ]:
data = pd.DataFrame({'price':[95,25,85,41,78],'ticker':['AXP','CSCO','DIS','MSFT','WMT'],
                  'company':['American Express','Cisco','Walt Disney','Microsoft','Walmart']})
data

In [ ]:
data['company']

In [ ]:
data.company

### FILL MISSING VALUE

Reindex Function
#### How to fill a missing value with some value in the data frame?

In [ ]:
subjects = ['English','Language','Maths','Science','Social']
student1 = pd.Series({'English':80,'Language':45,'Maths':99,'Social':56})
student2 = pd.Series({'Language':77,'Maths':69,'Social':55})
student3 = pd.Series({'English':44,'Language':48,'Maths':68,'Social':65})
student4 = pd.Series({'English':67,'Language':51,'Social':79})
student5 = pd.Series({'English':88,'Language':63,'Science':69,'Maths':83})
student6 = pd.Series({'Language':48,'Maths':80,'Science':56,'Social':73})
student7 = pd.Series({'English':82,'Maths':90,'Science':88,'Social':91})
df2 = pd.DataFrame(columns=['Student1','Student2','Student3','Student4','Student5','Student6','Student7'],index=subjects)
df2.Student1 = student1
df2.Student2 = student2
df2.Student3 = student3
df2.Student4 = student4
df2.Student5 = student5
df2.Student6 = student6
df2.Student7 = student7
df2

In [ ]:
df2.reindex(['Craft','English','Language','Maths','Science','Social','Training'])

In [ ]:
reindexdf2 = df2.reindex(['Craft','English','Language','Maths','Science','Social','Training'], fill_value=0)
reindexdf2

#### How to fill the missing value with the previous value?

In [ ]:
reindexdf3 = df2.reindex(['Craft','English','Language','Maths','Science','Social','Training'], method='ffill')
reindexdf3

#### How to fill the missing value backwards?

In [ ]:
reindexdf4 = df2.reindex(['Craft','English','Language','Maths','Science','Social','Training'],
                         method='bfill')
reindexdf4

### DROPPING DUPLICATED VALUES

#### Drop the duplicate row of a dataframe

In [ ]:
d = {
    'Name':['Alisa','Bobby','jodha','jack','raghu','Cathrine',
            'Alisa','Bobby','kumar','Alisa','Alex','Cathrine'],
    'Age':[26,24,23,22,23,24,26,24,22,23,24,24],
      
    'Score':[85,63,55,74,31,77,85,63,42,62,89,77]}
 
df = pd.DataFrame(d,columns=['Name','Age','Score'])
df

In [ ]:
df.duplicated() # checking row duplications

In [ ]:
df.duplicated(['Age']) #check for specific column duplications

In [ ]:
df.drop_duplicates()

#### Drop the duplicate by retaining last occurrence

In [ ]:
df.drop_duplicates(keep='last')

#### Drop the duplicate by column

In [ ]:
df.drop_duplicates(['Age'], keep='last')

#### Simply drop a row or observation

### DROP ROW / COLUMN

In [ ]:
df

#### Drop rows or observations

In [ ]:
df.drop([1,2])

#### Drop rows or observations by condition

In [ ]:
df[df.Name != 'Alisa']

#### Drop a row or observation by index

In [ ]:
df.drop(df.index[2])

#### Drop a row by position

In [ ]:
df[:-3]

#### Drop a column by name

In [ ]:
df.drop('Age',axis=1)

#### Drop a column based on column index

In [ ]:
df.drop(df.columns[0],axis=1)

In [ ]:
df

#### Delete a column based on column name

In [ ]:
del df['Age']

In [ ]:
df

### SORTING

In [ ]:
d = {'Name':pd.Series(['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa']),
   'Age':pd.Series([26,27,25,24,31,27,25,33,42,32,51,47]),
   'Score':pd.Series([89,87,67,55,47,72,76,79,44,92,99,69])}

df2 = pd.DataFrame(d)
df2

#### Sorting by column

In [ ]:
df2.sort_values(by='Score')

#### Sorting by column in descending order

In [ ]:
df2.sort_values(by='Score',ascending=0)

In [ ]:
df3 = df2.sort_values(['Age','Score'],ascending=[False,True])
df3

#### Sorting by index

In [ ]:
df3.sort_index(ascending=False)

### RANKING

In [ ]:
d = {
    'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
            'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
   'Score':[62,47,55,74,31,77,85,63,42,67,89,89]}
 
df4 = pd.DataFrame(d,columns=['Name','Score'])
df4

#### Ranking in ascending order

In [ ]:
df4['Rank']=df4['Score'].rank()
df4

#### Ranking in descending order

In [ ]:
df4['score_ranked']=df4['Score'].rank(ascending=0)
df4

#### Ranking by minimum value

In [ ]:
df4['Rank_min']=df4['Score'].rank(ascending=0,method='min')
df4

#### Ranking by maximum value

In [ ]:
df4['Score_max']=df4['Score'].rank(ascending=0,method='max')
df4

### DENSE RANK

In [ ]:
df4['Score_Dense']=df4['Score'].rank(ascending=0,method='dense')
df4

### HIERARCHICAL INDEXING OR MULTIPLE INDEXING

In [ ]:
d = {
    'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine',
            'Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1',
            'Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
     
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science',
               'Mathematics','Mathematics','Mathematics','Science','Science','Science'],
   'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}
 
df5 = pd.DataFrame(d,columns=['Name','Exam','Subject','Score'])
df5

In [ ]:
df6=df5.set_index(['Exam', 'Subject'])
df6

In [ ]:
df6.index

### Swap the column in hierarchical index

In [ ]:
df = df6.swaplevel('Subject','Exam')
df

### Sorting Index

In [ ]:
df.sort_index(level=0)

### MAPPING

In [ ]:
df1 = DataFrame({'Names':['Aniket','Aniruddha','Abhay'],'Weight':[50,170,90]})
df1

In [ ]:
height = {'Aniruddha':6,'Aniket':4,'Abhay':5}
height

In [ ]:
df1['Height']=df1['Names'].map(height)

In [ ]:
df1

### REPLACING

In [ ]:
df1

In [ ]:
df1['Weight']=df1['Weight'].replace({170:70})
df1

### RENAMING

In [ ]:
df1

In [ ]:
df1 = df1.rename(columns={'Mames':'Names','Weight':'Weights kgs'})

In [ ]:
df1

### SUMMARY STATISTICS

In [ ]:
data = pd.read_csv("wine.csv", encoding="latin-1")
data.tail()

#### Summary statistics of the numeric columns

In [ ]:
data.describe()

#### Summary statistics of all the columns

In [ ]:
data.describe(include='all')

#### Basic information on data

In [ ]:
data.info()

### Measure of Central Tendency.

#### Let's Calculate mean of the Data

In [2]:
d = {
    'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa'],
   'Score1':[62,47,55,74,31,77,85,63,42,32,71,57],
   'Score2':[89,87,67,55,47,72,76,79,44,92,99,69]}

df = pd.DataFrame(d)
df

         Name  Score1  Score2
0       Alisa      62      89
1       Bobby      47      87
2    Cathrine      55      67
3     Madonna      74      55
4       Rocky      31      47
5   Sebastian      77      72
6    Jaqluine      85      76
7       Rahul      63      79
8       David      42      44
9      Andrew      32      92
10       Ajay      71      99
11     Teresa      57      69

In [3]:
df.mean()

Score1    58.0
Score2    73.0
dtype: float64

#### Row Mean

In [4]:
df.mean(axis=1)

0     75.5
1     67.0
2     61.0
3     64.5
4     39.0
5     74.5
6     80.5
7     71.0
8     43.0
9     62.0
10    85.0
11    63.0
dtype: float64

#### Column Mean

In [5]:
df.mean(axis=0)

Score1    58.0
Score2    73.0
dtype: float64

#### Mean of the specific column

In [6]:
df['Score1'].mean()

58.0

In [7]:
df.loc[:,"Score1"].mean()

58.0

### Let's Calculate median of the Data

In [12]:
df1 = df

In [9]:
import statistics

In [10]:
print(statistics.median([1,9,5,6,8,7]))
print(statistics.median([4,-11,-5,16,5,7,9]))

6.5
5

In [14]:
df1

         Name  Score1  Score2
0       Alisa      62      89
1       Bobby      47      87
2    Cathrine      55      67
3     Madonna      74      55
4       Rocky      31      47
5   Sebastian      77      72
6    Jaqluine      85      76
7       Rahul      63      79
8       David      42      44
9      Andrew      32      92
10       Ajay      71      99
11     Teresa      57      69

In [15]:
df1.median()

Score1    59.5
Score2    74.0
dtype: float64

#### Column Median of the dataframe:

In [16]:
df1.median(axis=0)

Score1    59.5
Score2    74.0
dtype: float64

#### Median of the specific Column

In [17]:
df1.loc[:,"Score1"].median()

59.5

### Let's Calculate Mode of the Data

In [18]:
import statistics

In [19]:
print(statistics.mode([1,5,5,7,5,6,8,7]))
print(statistics.mode(['lion', 'cat', 'cat','dog','tiger']))

5
cat

### Mode of a dataframe

In [20]:
d = {
    'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa'],
   'Score1':[62,47,55,74,47,77,85,63,42,32,71,57],
   'Score2':[89,87,67,55,47,72,76,79,44,67,99,69],
   'Score3':[56,86,77,45,73,62,74,89,71,67,97,68]}

df2 = pd.DataFrame(d)
df2

         Name  Score1  Score2  Score3
0       Alisa      62      89      56
1       Bobby      47      87      86
2    Cathrine      55      67      77
3     Madonna      74      55      45
4       Rocky      47      47      73
5   Sebastian      77      72      62
6    Jaqluine      85      76      74
7       Rahul      63      79      89
8       David      42      44      71
9      Andrew      32      67      67
10       Ajay      71      99      97
11     Teresa      57      69      68

In [21]:
df2.mode()

         Name  Score1  Score2  Score3
0        Ajay    47.0    67.0      45
1       Alisa     NaN     NaN      56
2      Andrew     NaN     NaN      62
3       Bobby     NaN     NaN      67
4    Cathrine     NaN     NaN      68
5       David     NaN     NaN      71
6    Jaqluine     NaN     NaN      73
7     Madonna     NaN     NaN      74
8       Rahul     NaN     NaN      77
9       Rocky     NaN     NaN      86
10  Sebastian     NaN     NaN      89
11     Teresa     NaN     NaN      97

#### Row Mode

In [22]:
df2.mode(axis=1)

C:\Users\Content_ACER\Anaconda3\lib\site-packages\pandas\core\algorithms.py:838: UserWarning: Unable to sort modes: '<' not supported between instances of 'str' and 'int'
  warn("Unable to sort modes: {error}".format(error=e))
C:\Users\Content_ACER\Anaconda3\lib\site-packages\pandas\core\algorithms.py:838: UserWarning: Unable to sort modes: '<' not supported between instances of 'int' and 'str'
  warn("Unable to sort modes: {error}".format(error=e))

       0      1        2          3
0     56     89       62      Alisa
1     86     47    Bobby         87
2     67     77       55   Cathrine
3     74     45  Madonna         55
4     47    NaN      NaN        NaN
5     72     77       62  Sebastian
6     74     76       85   Jaqluine
7     89  Rahul       63         79
8     71     42       44      David
9     67    NaN      NaN        NaN
10  Ajay     99       97         71
11    57     68   Teresa         69

#### Column Mode

In [23]:
df2.mode(axis=0)

         Name  Score1  Score2  Score3
0        Ajay    47.0    67.0      45
1       Alisa     NaN     NaN      56
2      Andrew     NaN     NaN      62
3       Bobby     NaN     NaN      67
4    Cathrine     NaN     NaN      68
5       David     NaN     NaN      71
6    Jaqluine     NaN     NaN      73
7     Madonna     NaN     NaN      74
8       Rahul     NaN     NaN      77
9       Rocky     NaN     NaN      86
10  Sebastian     NaN     NaN      89
11     Teresa     NaN     NaN      97

#### Mode of the specific Column

In [24]:
df2.loc[:,"Score1"].mode()

0    47
dtype: int64

### ZSCORE

In [ ]:
from scipy.stats import zscore

In [ ]:
zscore([1, 2, 3])

In [ ]:
zscore([[1, 2, 3],[6, 7, 8]], axis=1)

### STANDARD DEVIATION

#### Simple Standard deviation Function in Python

In [ ]:
import numpy as np
 
print(np.std([1,9,5,6,8,7]))
print(np.std([4,-11,-5,16,5,7,9]))

#### Standard deviation of a dataframe

In [ ]:
d = {
    'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa'],
   'Score1':[62,47,55,74,31,77,85,63,42,32,71,57],
   'Score2':[89,87,67,55,47,72,76,79,44,92,99,69],
   'Score3':[56,86,77,45,73,62,74,89,71,67,97,68]}
 
df3 = pd.DataFrame(d)
df3

In [ ]:
df3.std()

#### Row standard deviation

In [ ]:
df3.std(axis=1)

#### Column Standard deviation

In [ ]:
df3.std(axis=0)

#### standard deviation of the specific Column

In [ ]:
df3.loc[:,"Score1"].std()

### COEFFICIENT OF CORRELATION

In [ ]:
df3.corr()

### SKEWNESS AND KURTOSIS

Skewness - Measure of the asymmetry in the distribution (either to the left or to the right).

S = Negative indicates data are skewed left.

S = Positive indicates data are skewed right.

S = 0 indicates data are normally distributed.

Kurtosis - Measure of the relative peakedness of a distribution.

K = 3 indicates a normal bellshaped distribution (mesokurtic).

K < 3 indicates a platykurtic distribution (flatter than a normal distribution with shorter tails).

K > 3 indicates a leptokurtic distribution (more peaked than a normal distribution with longer tails).

In [ ]:
df3.skew()

In [ ]:
df3.kurtosis()

### VISUALIZATION : SEABORN AND MATPLOTLIB

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt

#### Lets create a small data using numpy array

In [ ]:
import numpy as np
x = np.linspace(0, 6, 11)
y = x ** 2

In [ ]:
x

In [ ]:
y

### LINE PLOT

In [ ]:
plt.plot(x, y) 
plt.xlabel('X Axis')
plt.ylabel('Y Axis')
plt.show()

### HISTOGRAM

In [ ]:
from random import sample
data = sample(range(1, 1000), 100)
plt.hist(data)

In [ ]:
# Plot with a whitegrid style
sns.set()
sns.set_style('whitegrid')
plt.hist(data)

#### Lets plot the same histogram with a default seaborn style

In [ ]:
sns.set()
plt.hist(data)
plt.show()
plt.clf()

### BOX PLOT

In [ ]:
sns.boxplot(data=data)
plt.show()
plt.clf()

### SCATTER PLOT

In [ ]:
plt.scatter(x,y)

### CASE STUDY

#### House Prices Analysis

Objective of the study is to perform EDA for the variables which will help later to build model later to predict the area which might get affected.

#### Invoke libraries

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from scipy.stats import norm
from sklearn.preprocessing import StandardScaler
from scipy import stats
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [ ]:
df_train = pd.read_csv('house_train.csv')

In [ ]:
df_train.columns

In [ ]:
df_train.info()

In [ ]:
df_train.head()

In [ ]:
df_train.shape

In [ ]:
df_train['SalePrice'].describe()

#### Histogram of SalePrice

In [ ]:
sns.distplot(df_train['SalePrice']);

#### Skewness and Kurtosis of SalePrice

In [ ]:
print("Skewness: %f" % df_train['SalePrice'].skew())
print("Kurtosis: %f" % df_train['SalePrice'].kurt())

#### Let us do some bivariate analysis to see which variables might be good for predicting sales price
#### box plot overallqual/saleprice

In [ ]:
data = pd.concat([df_train['SalePrice'], df_train['OverallQual']], axis=1)
f, ax = plt.subplots(figsize=(8, 6))
fig = sns.boxplot(x='OverallQual', y="SalePrice", data=data)
fig.axis(ymin=0, ymax=800000);

In [ ]:
var = 'YearBuilt'
data = pd.concat([df_train['SalePrice'], df_train[var]], axis=1)
f, ax = plt.subplots(figsize=(16, 8))
fig = sns.boxplot(x=var, y="SalePrice", data=data)
fig.axis(ymin=0, ymax=800000);
plt.xticks(rotation=90);

#### Correlation Matrix

In [ ]:
corrmat = df_train.corr()
f, ax = plt.subplots(figsize=(12, 9))
sns.heatmap(corrmat)

#### Scatter Plot

In [ ]:
cols = ['SalePrice', 'OverallQual', 'GrLivArea', 'GarageCars', 'TotalBsmtSF', 'FullBath', 'YearBuilt']
sns.pairplot(df_train[cols], size = 2.5)
plt.show();

In [ ]:
corr=df_train.corr()["SalePrice"]
corr

### Some data transformations
### Histogram and Normal Probability Plot

In [ ]:
sns.distplot(df_train['SalePrice'], fit=norm);
fig = plt.figure()
res = stats.probplot(df_train['SalePrice'], plot=plt)

#### Applying log transformation

In [ ]:
df_train['SalePrice'] = np.log(df_train['SalePrice'])
#transformed histogram and normal probability plot
sns.distplot(df_train['SalePrice'], fit=norm);
fig = plt.figure()
res = stats.probplot(df_train['SalePrice'], plot=plt)

#### Histogram and Normal Probability Plot

In [ ]:
sns.distplot(df_train['GrLivArea'], fit=norm);
fig = plt.figure()
res = stats.probplot(df_train['GrLivArea'], plot=plt)

In [ ]:
df_train['GrLivArea'] = np.log(df_train['GrLivArea'])
#transformed histogram and normal probability plot
sns.distplot(df_train['GrLivArea'], fit=norm);
fig = plt.figure()
res = stats.probplot(df_train['GrLivArea'], plot=plt)

#### How about missing values

In [ ]:
null_columns=df_train.columns[df_train.isnull().any()]
df_train[null_columns].isnull().sum()

### Multivariate Analysis

In [ ]:
df_train['LotFrontage'].corr(df_train['LotArea'])

In [ ]:
df_train['SqrtLotArea']=np.sqrt(df_train['LotArea'])
df_train['LotFrontage'].corr(df_train['SqrtLotArea'])

In [ ]:
sns.jointplot(df_train['LotFrontage'],df_train['SqrtLotArea'],color='gold');

In [ ]:
plt.scatter(df_train["MasVnrArea"],df_train["SalePrice"])
plt.title("MasVnrArea Vs SalePrice ")
plt.ylabel("SalePrice")
plt.xlabel("Mas Vnr Area in sq feet");

#### Basement Variable

In [ ]:
plt.scatter(df_train["TotalBsmtSF"],df_train["SalePrice"])
plt.title("TotalBsmtSF Vs SalePrice ")
plt.ylabel("SalePrice")
plt.xlabel("TotalBsmtSF");

#### Treatment of outliers
#### There are few outliers in total basement area; lets remove them

In [ ]:
upperlimit = np.percentile(df_train.TotalBsmtSF.values, 99.5)
df_train['TotalBsmtSF'].ix[df_train['TotalBsmtSF']>upperlimit] = upperlimit

plt.scatter(df_train.TotalBsmtSF, df_train["SalePrice"].values,color='orange')
plt.title("TotalBsmtSF Vs SalePrice ")
plt.ylabel("SalePrice")
plt.xlabel("Total Basement in sq feet");

#### Dealing with categorical variables

In [ ]:
sns.factorplot("Fireplaces","SalePrice",data=df_train,hue="FireplaceQu");

#### Does amount of 1st floor area help in sales price prediction?

In [ ]:
plt.scatter(df_train["1stFlrSF"],df_train.SalePrice, color='red')
plt.title("Sale Price wrt 1st floor")
plt.ylabel('Sale Price (in dollars)')
plt.xlabel("1st Floor in square feet");

#### Create a new variables - sales price per sq ft

In [ ]:
df_train['SalePriceSF'] = df_train['SalePrice']/df_train['GrLivArea']
plt.hist(df_train['SalePriceSF'], bins=15,color="gold")
plt.title("Sale Price per Square Foot")
plt.ylabel('Number of Sales')
plt.xlabel('Price per square feet');